class Text:
    # ---------- Пути к файлам ---------- #
    logsFilepath = "databases/logs.log"
    databaseFilepath = "databases/bot_database.sqlite"
    # ----------------------------------- #

    # ---------- Протокольные сообщения ---------- #
    fillingTheTableAuthorizationLog = ("Таблица {} успешно обновлена. Старые данные удалены. Новые данные:"
                                       "{}: {}, {}: {}")

    loggerConnectedLog = "Логгер успешно подключён."
    pollingStartedLog = "Поллинг бота успешно запущен."
    authorizationConnectedLog = "Класс Authorization успешно импортирован. Таблица Authorization подключена."

    # -------------------------------------------- #

    # ---------- ID групп, каналов и чатов ---------- #
    # ----------------------------------------------- #

    # ---------- Содержание кнопок ---------- #
    # --------------------------------------- #

    # ---------- Команды бота ---------- #
    # ---------------------------------- #

    # ---------- Сообщения бота ---------- #
    # ------------------------------------ #

